{
	"SUB_TITLE": "Building <span class='ga-blue-text'>consistent</span> and <span class='ga-green-text'>meaningful</span> UI with Semantic CSS",
  "MAIN_SECTION_STYLE_TITLE": "Custom Style Systems",
	"MAIN_SECTION_STYLE_DESC": "Build unified style systems from your own design tokens.",
	"MAIN_SECTION_THEME_TITLE": "Dark Theme Ready",
	"MAIN_SECTION_THEME_DESC": "Switch seamlessly between light and dark themes out of the box.",
	"MAIN_SECTION_CSS_TITLE": "Framework-Agnostic CSS",
	"MAIN_SECTION_CSS_DESC": "Use framework-agnostic CSS that extends Vue and React headless UI libraries.",
	"MAIN_SECTION_TOKEN_TITLE": "Token-Driven Semantic Design",
	"MAIN_SECTION_TOKEN_DESC": "Combine design tokens with natural, semantic class names for a readable design language.",
  "MAIN_SECTION_ELEMENT_TITLE": "Example UI Element",
  "MAIN_SECTION_CONTACT_TITLE": "Contact Me",
	"MAIN_SECTION_CONTACT_DESC": "",
  "WELCOME_FROG_TITLE": "Frog UI",  
  "WELCOME_FROG_DESC": "The Frog design system was designed with the goal of <span class='bold'>\"expressing styles through language, not code\"</span>. When developers implement UI, it allows them to apply styles like drawing a picture using natural sentences, instead of cryptic tokens or abbreviations.",
  "WELCOME_SEMANTIC_TITLE": "Semantic CSS Close to Natural Language",
  "WELCOME_SEMANTIC_DESC": "In this system, class naming is structured to <span class='bold'>directly describe the visual characteristics</span> of components. For example, a sentence like \"a small primary button with rounded corners and a left icon\" is broken down directly into classes such as button, primary, round, icon, left, and small. This allows developers to translate UI images in their minds into code using language close to natural language, without having to memorize separate abbreviation rules.",
  "WELCOME_DRAWING_TITLE": "Applying Styles Like Drawing",
  "WELCOME_DRAWING_DESC": "The Semantic CSS approach focuses on <span class='bold'>\"what to show\"</span>, making the implementation process intuitive, like sketching. When creating a button, visual elements such as color, size, shape, and icon position are stacked and combined word by word, so design intent and code correspond 1:1.<br/> As a result, both designers and developers can discuss components using the same language, and new team members can quickly understand the structure and role just by looking at class names.",
  "WELCOME_USEFUL_TITLE": "Enhanced Usability and Consistency",
  "WELCOME_USEFUL_DESC": "This approach reduces the need to memorize complex utility abbreviations or framework-specific acronyms, lowering the learning curve. At the same time, by establishing a common vocabulary based on words with clear meanings like button, primary, and round, style usage naturally maintains consistency throughout the project. This consistency leads to maintainability and scalability, and the advantages of semantic CSS become more pronounced as the system grows.",
  "FAQS_TABS_ITEM_1": "Concepts",
  "FAQS_TABS_ITEM_2": "Semantic CSS",
  "FAQS_TABS_ITEM_3": "Experience & Collaboration",
  "FAQS_TABS_ITEM_4": "Architecture & Scalability",
  "FAQS_TABS_ITEM_5": "Performance & Tech",
  "FAQS_CONCEPT_1_Q": "What is the core concept of FROG UI?",
  "FAQS_CONCEPT_1_A": "FROG UI was created with the goal of <mark>\"expressing styles through language, not code\"</mark>. It is designed to allow developers to express UI like drawing a picture by combining words close to natural language, instead of abbreviations or shortened codes.",
  "FAQS_CONCEPT_2_Q": "Why use a CSS framework·semantic CSS approach instead of CSS‑in‑JS?",
  "FAQS_CONCEPT_2_A": "We adopted the semantic CSS pattern to separate design tokens and style layers from the JavaScript runtime for better performance, while simultaneously creating <mark>a reusable design language that is independent of frameworks/platforms.</mark>",
  "FAQS_SEMANTIC_1_Q": "What does 'Semantic CSS' mean in this system?",
  "FAQS_SEMANTIC_1_A": "It refers to a method of expressing <mark>the visual and intentional characteristics of components using meaningful words</mark>. For example, a button's role, size, shape, icon position, etc. are directly expressed as words and used as classes.",
  "FAQS_SEMANTIC_2_Q": "What specifically does it mean to apply styles like natural language?",
  "FAQS_SEMANTIC_2_A": "It means directly translating a sentence like \"a small primary button that is round and includes a left icon\" into a class combination such as button primary round icon left small. In other words, it provides an experience of translating sentences in your mind almost directly into code.",
  "FAQS_SEMANTIC_3_Q": "Why not use abbreviated utility classes like Tailwind?",
  "FAQS_SEMANTIC_3_A": "Abbreviation-based utilities are fast, but as teams grow, the cost of memorizing and interpreting rules increases. This system uses words with immediately readable meanings like primary, round, and small, prioritizing readability and onboarding experience.",
  "FAQS_EXPERIENCE_1_Q": "How does this help collaboration with designers?",
  "FAQS_EXPERIENCE_1_A": "<mark>The language designers use and the words used in code become almost identical</mark>. A sentence like \"please add a left icon to a primary round small button\" effectively becomes the class combination itself, which reduces interpretation loss when translating design specs into code.",
  "FAQS_EXPERIENCE_2_Q": "What is the learning curve like when new team members join?",
  "FAQS_EXPERIENCE_2_A": "Instead of memorizing framework-specific abbreviations, they just need to understand words they already know. By simply scanning the class names, they can infer the role and style of a component, which speeds up understanding of existing code and adaptation.",
  "FAQS_EXPERIENCE_3_Q": "Can consistency be maintained even in large-scale projects?",
  "FAQS_EXPERIENCE_3_A": "Because core vocabulary (e.g., button, primary, danger, round, small, etc.) is proactively defined and enforced in the design system, everyone shares the same word set even as the team grows. As a result, <mark>style combinations remain flexible while tokens and meanings stay consistent.</mark>",
  "FAQS_ARCHITECTURE_1_Q": "How are component variants expressed?",
  "FAQS_ARCHITECTURE_1_A": "Each variant is expressed with a single meaningful word. For example, a button uses role variants like primary and secondary, combined with size variants like tiny, small, large, and huge.",
  "FAQS_ARCHITECTURE_2_Q": "What principles are followed when adding new style tokens?",
  "FAQS_ARCHITECTURE_2_A": "As much as possible, we choose tokens based on whether they are <mark>\"frequently used, simple, and familiar words.\"</mark> We prioritize expressions that designers and developers will actually use in conversations, and prefer full names and meaning-centered naming over abbreviations. (Commonly used abbreviations like xs and sm are allowed as exceptions.)",
  "FAQS_ARCHITECTURE_3_Q": "How are responsive styles handled?",
  "FAQS_ARCHITECTURE_3_A": "Responsive behavior is also expressed using meaning-based prefixes or dedicated rules. Even when using device-based breakpoints like md or lg, our principle is to keep the internal tokens and combinations human-readable.",
  "FAQS_PERPORMANCE_1_Q": "Is FROG tied to a specific frontend framework?",
  "FAQS_PERPORMANCE_1_A": "No. Since styles exist as <mark>a CSS layer independent of any framework</mark>, it is designed so that the same design language can be used across various environments such as React, Vue, and Web Components.",
  "FAQS_PERPORMANCE_2_Q": "What performance benefits does it offer?",
  "FAQS_PERPORMANCE_2_A": "By default, it <mark>uses pre-prepared static CSS</mark> instead of generating or injecting styles at runtime. This reduces unnecessary JavaScript overhead during initial load and re-rendering.",
  "BASE_TYPOGRAPHY_SUB_TITLE": "Foundations typography like font sizes, spacing, weight and Heading System.",
  "BASE_COLORS_SUB_TITLE": "Defined color tokens for branding, backgrounds, and UI states.",
  "ELEMENTS_BUTTON_SUB_TITLE": "Interactive buttons with variants for size, color, and state.",
  "ELEMENTS_INPUT_SUB_TITLE": "Text input fields with consistent styling and focus handling.",
  "ELEMENTS_TAG_SUB_TITLE": "Compact label elements used for status indicators or filters.",
  "ELEMENTS_CHECKBOX_SUB_TITLE": "Multi-select input with accessible and clear visual states.",
  "ELEMENTS_SWITCH_SUB_TITLE": "Toggle-style input for on/off states with smooth transitions.",
  "ELEMENTS_BADGE_SUB_TITLE": "Small visual indicators showing counts or statuses.",
  "ELEMENTS_FORM_SUB_TITLE": "Grouped input structure with labels, validation, and layout.",
  "ELEMENTS_LIST_SUB_TITLE": "Structured list styling for displaying repeated content.",
  "ELEMENTS_SELECTBOX_SUB_TITLE": "Dropdown UI for selecting a single item from options.",
  "ELEMENTS_MESSAGE_SUB_TITLE": "Informational, warning, or error messages for user feedback.",
  "ELEMENTS_TABS_SUB_TITLE": "UI for toggling between content sections in a tabbed layout.",
  "ELEMENTS_CARDS_SUB_TITLE": "Content containers for grouping text, images, and actions.",
  "ELEMENTS_SEGMENTS_SUB_TITLE": "Content containers for grouping text, images, and actions.",
  "ELEMENTS_TABLE_SUB_TITLE": "Data tables with support for rows, headers, and styling.",
  "ELEMENTS_PAGINATION_SUB_TITLE": "UI for navigating through multiple pages of content.",
  "ELEMENTS_PANEL_SUB_TITLE": "Expandable/collapsible side or content panels.",
  "ELEMENTS_CALENDAR_SUB_TITLE": "Date picker and scheduling UI component.",
  "LAYOUT_GRID_SUB_TITLE": "Layout utility using CSS Grid for structured alignment.(Flex)",
  "LAYOUT_GRID2_SUB_TITLE": "Layout utility using CSS Grid for structured alignment.(Grid)",
  "MODULES_MODAL_SUB_TITLE": "Overlay dialog UI for alerts or focused interactions.",
  "MODULES_TOAST_SUB_TITLE": "Temporary, auto-dismissable message for quick user feedback."
}